Учебная/src/Documents/ПродажаТоваров/ПродажаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТоваров</name>
  <basedOn>Document.СчетНаОплату</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактынеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учебная/src/AccumulationRegisters/СтоимостьТоваров/СтоимостьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учебная/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учебная/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  </aggregates>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учебная/src/Documents/ПродажаТоваров/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Товары.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Движения.СтоимостьТоваров.Записывать = Истина;
	
#ОБласть регистр_СтоимостьТоваров 
		
//	ТЗ = Товары.Выгрузить();
//
Запрос = Новый Запрос;
Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
Запрос.Текст = 
"ВЫБРАТЬ
|	ПродажаТоваровТовары.Номенклатура КАК Номенклатура,
|	СУММА(ПродажаТоваровТовары.Количество) КАК Количество
|ПОМЕСТИТЬ ДокТЧ
|ИЗ
|	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
|ГДЕ
|	ПродажаТоваровТовары.Ссылка = &Ссылка
|
|СГРУППИРОВАТЬ ПО
|	ПродажаТоваровТовары.Номенклатура
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ДокТЧ.Номенклатура КАК Номенклатура,
|	ДокТЧ.Количество КАК Количество
|ИЗ
|	ДокТЧ КАК ДокТЧ";

Запрос.УстановитьПараметр("Ссылка", Ссылка);
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();


//ТЗ.Свернуть("Номенклатура", "Количество");
	
//	Для Каждого ТекСтрокаТовары Из ТЗ Цикл
	Пока Выборка.Следующий() Цикл
		Движение = Движения.СтоимостьТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Количество = Выборка.Количество;
	КонецЦикла;
	
	Движения.ОстаткиТоваров.БлокироватьДляИзменения = Истина;
		
	Движения.Записать();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(&МоментВремени, Склад = &Склад И Номенклатура В (Выбрать ДокТЧ.Номенклатура ИЗ ДокТЧ КАК ДокТЧ)) КАК ОстаткиТоваровОстатки
		|ГДЕ
		|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
	
	Граница = Новый Граница(МоментВремени(),ВидГраницы.Включая);
	
	Запрос.УстановитьПараметр("МоментВремени", Граница);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("МассивТоваров", Товары.ВыгрузитьКолонки("Номенклатура"));
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
	КонецЕсли;	
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Сообщить("Мало товаара " + Выборка.Номенклатура  + " , Нужно еще " + (-Выборка.КоличествоОстаток));
		КонецЦикла;
///////////////////////////////////////////////////////////		
		Если Отказ Тогда;
			Возврат
		КонецЕсли;
		
				
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.СтоимостьТоваров");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = Товары;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
		Блокировка.Заблокировать();
		
		Движения.СтоимостьТоваров.БлокироватьДляИзменения = Истина;
		
		Если Режим = РежимПроведенияДокумента.Оперативный Тогда
			Движения.СтоимостьТоваров.Записать();
		КонецЕсли;
		
Запрос.Текст = 
"ВЫБРАТЬ
|	СтоимостьТоваровОстатки.Номенклатура КАК Номенклатура,
|	СтоимостьТоваровОстатки.Партия КАК Партия,
|	СтоимостьТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
|	СтоимостьТоваровОстатки.СтоимостьОстаток КАК СтоимостьОстаток,
|	СтоимостьТоваровОстатки.Партия.МоментВремени КАК ПартияМоментВремени
|ПОМЕСТИТЬ Остатки
|ИЗ
|	РегистрНакопления.СтоимостьТоваров.Остатки(
|			&МоментВремени,
|			Номенклатура В
|				(ВЫБРАТЬ
|					ДокТЧ.Номенклатура
|				ИЗ
|					ДокТЧ КАК ДокТЧ)) КАК СтоимостьТоваровОстатки
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ДокТЧ.Номенклатура КАК Номенклатура,
|	ДокТЧ.Количество КАК Количество,
|	Остатки.Партия КАК Партия,
|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
|	Остатки.СтоимостьОстаток КАК СуммаОстаток
|ИЗ
|	ДокТЧ КАК ДокТЧ
|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
|		ПО ДокТЧ.Номенклатура = Остатки.Номенклатура
|
|УПОРЯДОЧИТЬ ПО
|	Остатки.ПартияМоментВремени
|ИТОГИ
|	МИНИМУМ(Количество),
|	СУММА(СуммаОстаток)
|ПО
|	Номенклатура";

Запрос.УстановитьПараметр("МоментВремени",МоментВремени());		
Результат = Запрос.Выполнить();
ВыборкаТовар = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

					Пока ВыборкаТовар.Следующий() Цикл
					Если ВыборкаТовар.КоличествоОстаток < ВыборкаТовар.Количество  Тогда
						Сообщить ("Что-то пошло не так, остаток стоимости не совпадает с остатками по складу");
						Отказ = Истина;
					КонецЕсли;
					
					ВыборкаПартия = ВыборкаТовар.Выбрать();
					
					ОсталосьСписать = ВыборкаТовар.Количество;
					
					Пока ВыборкаПартия.Следующий() И ОсталосьСписать <> 0 Цикл
						
						Списать = МИН (ОсталосьСписать, ВыборкаПартия.КоличествоОстаток);
																					
						Себестоимость = Списать/ВыборкаПартия.КоличествоОстаток *ВыборкаПартия.СтоимостьОстаток;
					
						Движение = Движения.СтоимостьТоваров.ДобавитьРасход();
						Движение.Период = Дата;
						Движение.Номенклатура = Выборка.Номенклатура;
						Движение.Партия = ВыборкаПартия.Партия;
						Движение.Количество = Списать;
						Движение.Стоимость = Себестоимость;
						
						ОсталосьСписать = ОсталосьСписать - Списать;
					
					КонецЦикла;
					
					
				КонецЦикла; 
				Движения.СтоимостьТоваров.Записывать = Истина;	
			
	
		
	
#КонецОбласти	

#Область регистр_Продажи
	 	// регистр Продажи
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Дата = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Подразделение = Подразделение;
		Движение.Контрагент = Контрагент;
		Движение.Договор = ДоговорКонтрагента;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Склад = Склад;
	КонецЦикла;

 
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Дата = Дата;
		Движение.Номенклатура = ТекСтрокаУслуги.Номенклатура;
		Движение.Подразделение = Подразделение;
		Движение.Контрагент = Контрагент;
		Движение.Договор = ДоговорКонтрагента;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
	КонецЦикла;
#КонецОбласти

#Область регистр_ОстаткиТоваров
// регистр ОстаткиТоваров Расход
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Серия = ТекСтрокаТовары.Серия;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	Движения.ОстаткиТоваров.БлокироватьДляИзменения = Истина;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;                    
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(&МоментВремени, Склад = &Склад) КАК ОстаткиТоваровОстатки
		|ГДЕ
		|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
	
	Граница = Новый Граница(МоментВремени(),ВидГраницы.Включая);
	
	Запрос.УстановитьПараметр("МоментВремени", Граница);
	Запрос.УстановитьПараметр("Склад", Склад);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Сообщить("Мало товаара " + Выборка.Номенклатура  + " , Нужно еще " + (-Выборка.КоличествоОстаток));
		КонецЦикла;
		
		
	КонецЕсли;
#КонецОбласти	
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Контрагент = ДанныеЗаполнения.Контрагент;
	Для каждого Стр Из ДанныеЗаполнения.Товары Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
КонецПроцедуры
